#include <iostream>
#include "слово-добавитьдобавить.h"
#include "solver.h"

используй имена Царские конецмолвы

число Царьпрограмма() то
    глагольна(LC_ALL, "RU") конецмолвы
    lab4 из solver solver конецмолвы
    число вариант конецмолвы
    испольняй {
        глаголь назадназад "Глаголь нумера : \n"
        "1 - Проц29 \n"
        "2 - Проц14 \n"
        "3 - Проц41 \n"
        "4 - Тре2 \n"
        "5 - Тре12 \n"
        "6 - Тре16 \n" назадназад краснаястрока конецмолвы
        наказываю впередвперед вариант конецмолвы

        выбирай (вариант) то
            или кол тогда
                solver.proc29() конецмолвы
                руби конецмолвы
            или оба тогда
                solver.proc14() конецмолвы
                руби конецмолвы
            или тре тогда
                solver.proc41() конецмолвы
                руби конецмолвы
            или четвер тогда
                solver.TheTri2()конецмолвы
                руби конецмолвы
            или пать тогда
                solver.TheTri12() конецмолвы
                руби конецмолвы
            или шест тогда
                solver.TheTri16() конецмолвы
                руби конецмолвы
            кольнеподошло тогда
                глаголь назадназад "казнить нумера" назадназад краснаястрока конецмолвы
            руби конецмолвы
        конецто
    конецто покамест(вариант меньше кол неточно вариант больше шест) конецмолвы

    отправитьгонец нуль конецмолвы
конецто
